"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.areaCoordinates = exports.cityCoordinates = exports.taiwanAreas = void 0;
exports.getAreaCoordinate = getAreaCoordinate;
exports.taiwanAreas = {
    台北市: ['中正區', '大同區', '中山區', '松山區', '大安區', '萬華區', '信義區', '士林區', '北投區', '內湖區', '南港區', '文山區'],
    新北市: ['板橋區', '三重區', '中和區', '永和區', '新莊區', '新店區', '土城區', '蘆洲區', '樹林區', '汐止區', '鶯歌區', '三峽區', '淡水區', '瑞芳區', '五股區', '泰山區', '林口區', '深坑區', '石碇區', '坪林區', '三芝區', '石門區', '八里區', '平溪區', '雙溪區', '貢寮區', '金山區', '萬里區', '烏來區'],
    桃園市: ['桃園區', '中壢區', '平鎮區', '八德區', '楊梅區', '蘆竹區', '大溪區', '龍潭區', '龜山區', '大園區', '觀音區', '新屋區', '復興區'],
    台中市: ['中區', '東區', '南區', '西區', '北區', '北屯區', '西屯區', '南屯區', '太平區', '大里區', '霧峰區', '烏日區', '豐原區', '后里區', '石岡區', '東勢區', '和平區', '新社區', '潭子區', '大雅區', '神岡區', '大肚區', '沙鹿區', '龍井區', '梧棲區', '清水區', '大甲區', '外埔區', '大安區'],
    台南市: ['中西區', '東區', '南區', '北區', '安平區', '安南區', '永康區', '歸仁區', '新化區', '左鎮區', '玉井區', '楠西區', '南化區', '仁德區', '關廟區', '龍崎區', '官田區', '麻豆區', '佳里區', '西港區', '七股區', '將軍區', '學甲區', '北門區', '新營區', '後壁區', '白河區', '東山區', '六甲區', '下營區', '柳營區', '鹽水區', '善化區', '大內區', '山上區', '新市區', '安定區'],
    高雄市: ['新興區', '前金區', '苓雅區', '鹽埕區', '鼓山區', '旗津區', '前鎮區', '三民區', '楠梓區', '小港區', '左營區', '仁武區', '大社區', '岡山區', '路竹區', '阿蓮區', '田寮區', '燕巢區', '橋頭區', '梓官區', '彌陀區', '永安區', '湖內區', '鳳山區', '大寮區', '林園區', '鳥松區', '大樹區', '旗山區', '美濃區', '六龜區', '內門區', '杉林區', '甲仙區', '桃源區', '那瑪夏區', '茂林區', '茄萣區'],
    基隆市: ['仁愛區', '信義區', '中正區', '中山區', '安樂區', '暖暖區', '七堵區'],
    新竹市: ['東區', '北區', '香山區'],
    嘉義市: ['東區', '西區'],
    新竹縣: ['竹北市', '竹東鎮', '新埔鎮', '關西鎮', '湖口鄉', '新豐鄉', '芎林鄉', '橫山鄉', '北埔鄉', '寶山鄉', '峨眉鄉', '尖石鄉', '五峰鄉'],
    苗栗縣: ['苗栗市', '苑裡鎮', '通霄鎮', '竹南鎮', '頭份市', '後龍鎮', '卓蘭鎮', '大湖鄉', '公館鄉', '銅鑼鄉', '南庄鄉', '頭屋鄉', '三義鄉', '西湖鄉', '造橋鄉', '三灣鄉', '獅潭鄉', '泰安鄉'],
    彰化縣: ['彰化市', '員林市', '和美鎮', '鹿港鎮', '溪湖鎮', '二林鎮', '田中鎮', '北斗鎮', '花壇鄉', '芬園鄉', '大村鄉', '永靖鄉', '伸港鄉', '線西鄉', '福興鄉', '秀水鄉', '埔心鄉', '埔鹽鄉', '大城鄉', '芳苑鄉', '竹塘鄉', '社頭鄉', '二水鄉', '田尾鄉', '埤頭鄉', '溪州鄉'],
    南投縣: ['南投市', '埔里鎮', '草屯鎮', '竹山鎮', '集集鎮', '名間鄉', '鹿谷鄉', '中寮鄉', '魚池鄉', '國姓鄉', '水里鄉', '信義鄉', '仁愛鄉'],
    雲林縣: ['斗六市', '斗南鎮', '虎尾鎮', '西螺鎮', '土庫鎮', '北港鎮', '古坑鄉', '大埤鄉', '莿桐鄉', '林內鄉', '二崙鄉', '崙背鄉', '麥寮鄉', '東勢鄉', '褒忠鄉', '台西鄉', '元長鄉', '四湖鄉', '口湖鄉', '水林鄉'],
    嘉義縣: ['太保市', '朴子市', '布袋鎮', '大林鎮', '民雄鄉', '溪口鄉', '新港鄉', '六腳鄉', '東石鄉', '義竹鄉', '鹿草鄉', '水上鄉', '中埔鄉', '竹崎鄉', '梅山鄉', '番路鄉', '大埔鄉', '阿里山鄉'],
    屏東縣: ['屏東市', '潮州鎮', '東港鎮', '恆春鎮', '萬丹鄉', '長治鄉', '麟洛鄉', '九如鄉', '里港鄉', '鹽埔鄉', '高樹鄉', '萬巒鄉', '內埔鄉', '竹田鄉', '新埤鄉', '枋寮鄉', '新園鄉', '崁頂鄉', '林邊鄉', '南州鄉', '佳冬鄉', '琉球鄉', '車城鄉', '滿州鄉', '枋山鄉', '三地門鄉', '霧台鄉', '瑪家鄉', '泰武鄉', '來義鄉', '春日鄉', '獅子鄉', '牡丹鄉'],
    宜蘭縣: ['宜蘭市', '羅東鎮', '蘇澳鎮', '頭城鎮', '礁溪鄉', '壯圍鄉', '員山鄉', '冬山鄉', '五結鄉', '三星鄉', '大同鄉', '南澳鄉'],
    花蓮縣: ['花蓮市', '鳳林鎮', '玉里鎮', '新城鄉', '吉安鄉', '壽豐鄉', '光復鄉', '豐濱鄉', '瑞穗鄉', '富里鄉', '秀林鄉', '萬榮鄉', '卓溪鄉'],
    台東縣: ['台東市', '成功鎮', '關山鎮', '卑南鄉', '鹿野鄉', '池上鄉', '東河鄉', '長濱鄉', '太麻里鄉', '大武鄉', '綠島鄉', '海端鄉', '延平鄉', '金峰鄉', '達仁鄉', '蘭嶼鄉'],
    澎湖縣: ['馬公市', '湖西鄉', '白沙鄉', '西嶼鄉', '望安鄉', '七美鄉'],
    金門縣: ['金城鎮', '金湖鎮', '金沙鎮', '金寧鄉', '烈嶼鄉', '烏坵鄉'],
    連江縣: ['南竿鄉', '北竿鄉', '莒光鄉', '東引鄉'],
};
exports.cityCoordinates = {
    台北市: { latitude: 25.0478, longitude: 121.5319 },
    新北市: { latitude: 25.012, longitude: 121.4657 },
    桃園市: { latitude: 24.9936, longitude: 121.301 },
    台中市: { latitude: 24.1477, longitude: 120.6736 },
    台南市: { latitude: 22.9999, longitude: 120.2269 },
    高雄市: { latitude: 22.6273, longitude: 120.3014 },
    基隆市: { latitude: 25.1276, longitude: 121.7392 },
    新竹市: { latitude: 24.8138, longitude: 120.9675 },
    嘉義市: { latitude: 23.4801, longitude: 120.4491 },
    新竹縣: { latitude: 24.839, longitude: 121.002 },
    苗栗縣: { latitude: 24.5602, longitude: 120.8214 },
    彰化縣: { latitude: 24.0717, longitude: 120.5624 },
    南投縣: { latitude: 23.9609, longitude: 120.9719 },
    雲林縣: { latitude: 23.7092, longitude: 120.4313 },
    嘉義縣: { latitude: 23.4589, longitude: 120.573 },
    屏東縣: { latitude: 22.5519, longitude: 120.5488 },
    宜蘭縣: { latitude: 24.7021, longitude: 121.7378 },
    花蓮縣: { latitude: 23.9871, longitude: 121.6015 },
    台東縣: { latitude: 22.7972, longitude: 121.0714 },
    澎湖縣: { latitude: 23.5711, longitude: 119.5793 },
    金門縣: { latitude: 24.4368, longitude: 118.3186 },
    連江縣: { latitude: 26.1602, longitude: 119.9517 },
};
exports.areaCoordinates = {
    '台北市-中山區': { latitude: 25.0645, longitude: 121.5336 },
    '台北市-大安區': { latitude: 25.0261, longitude: 121.5435 },
    '台北市-信義區': { latitude: 25.033, longitude: 121.5654 },
    '台北市-松山區': { latitude: 25.0497, longitude: 121.577 },
    '新北市-板橋區': { latitude: 25.0138, longitude: 121.4628 },
    '台中市-西屯區': { latitude: 24.1817, longitude: 120.6426 },
    '台中市-西區': { latitude: 24.1439, longitude: 120.6635 },
    '台南市-中西區': { latitude: 22.9969, longitude: 120.1986 },
    '高雄市-鼓山區': { latitude: 22.6519, longitude: 120.2818 },
    '高雄市-苓雅區': { latitude: 22.6211, longitude: 120.3123 },
};
function getAreaCoordinate(city, district) {
    return exports.areaCoordinates[`${city}-${district}`] ?? exports.cityCoordinates[city];
}
